Repository: mgarefal/RLP1
Catalog: src/FlaskBlogApp/translations/*/LC_MESSAGES/messages.po
Languages: el, es, fr

source: Welcome message
el: Καλωσήρθατε στο Ελληνικό Μεσογειακό Πανεπιστήμιο
es: Bienvenido a la Universidad Helénica Mediterránea
fr: Bienvenue à l'Université méditerranéenne hellénique

source: Page Title
el: ΕΛΜΕΠΑ - Ελληνικό Μεσογειακό Πανεπιστήμιο
es: HMU - Universidad Helénica Mediterránea
fr: HMU - Université méditerranéenne hellénique

source: department_message
el: Εργαστήριο Μικροηλεκτρονικών και Διαδικτύου των αντικειμένων
es: Laboratorio de Microelectrónica y Internet de las Cosas
fr: Laboratoire de microélectronique et d'Internet des objets

source: Remote Labs
el: Απομακρυσμένα Εργαστήρια
es: Laboratorios Remotos
fr: Laboratoires à distance

source: Remote Lab (Node-red)
el: Απομακρυσμένο Εργαστήριο (Node-red)
es: Laboratorio Remoto (Node-red)
fr: Laboratoire à distance (Node-red)

source: Remote Lab (external)
el: Απομακρυσμένο Εργαστήριο (εξωτερικό)
es: Laboratorio Remoto (externo)
fr: Laboratoire à distance (externe)

source: Remote Lab 1 (embedded)
el: Απομακρυσμένο Εργαστήριο 1 (ενσωματωμένο)
es: Laboratorio Remoto 1 (integrado)
fr: Laboratoire à distance 1 (intégré)

source: Remote Lab 1 (Test)
el: Απομακρυσμένο Εργαστήριο 1 (Δοκιμή)
es: Laboratorio Remoto 1 (Prueba)
fr: Laboratoire à distance 1 (Test)

source: Remote Lab 1 Monitor
el: Παρακολούθηση Απομακρυσμένου Εργαστηρίου 1
es: Monitor del Laboratorio Remoto 1
fr: Moniteur du laboratoire à distance 1

source: Home Page Button
el: Κουμπί Αρχικής
es: Página de Inicio
fr: Page d'accueil

source: Bookings
el: Κρατήσεις
es: Reservas
fr: Réservations

source: All Bookings
es: Todas las Reservas
fr: Toutes les réservations

source: My Bookings
el: Οι κρατήσεις μου
es: Mis Reservas
fr: Mes réservations

source: New Booking
el: Νέα κράτηση
es: Nueva Reserva
fr: Nouvelle réservation

source: Article Button
el: Σχέδια
es: Bocetos
fr: Croquis

source: My Sketches
el: Τα Σχέδιά μου
es: Mis Bocetos
fr: Mes croquis

source: New Sketch
el: Νέο Σχέδιο
es: Nuevo Boceto
fr: Nouveau croquis

source: Activities
el: Δραστηριότητες
es: Actividades
fr: Activités

source: User Activities
el: Δραστηριότητες Χρήστη
es: Actividades del Usuario
fr: Activités de l'utilisateur

source: New Activity
el: Νέα Δραστηριότητα
es: Nueva Actividad
fr: Nouvelle activité

source: Activity Status
el: Κατάσταση Δραστηριότητας
es: Estado de la Actividad
fr: Statut de l'activité

source: Language
el: Γλώσσα
es: Idioma
fr: Langue

source: English
el: Αγγλικά
es: Inglés
fr: Anglais

source: Ελληνικά
es: Griego
fr: Grec

source: System Management
el: Διαχείριση Συστήματος
es: Gestión del Sistema
fr: Gestion du système

source: Connected Users
el: Συνδεδεμένοι Χρήστες
es: Usuarios Conectados
fr: Utilisateurs connectés

source: Application Settings
el: Ρυθμίσεις Εφαρμογής
es: Configuración de la Aplicación
fr: Paramètres de l'application

source: User Group Settings
el: Ρυθμίσεις Ομάδας Χρηστών
es: Configuración de Grupos de Usuarios
fr: Paramètres de groupe d'utilisateurs

source: Booking Management
el: Διαχείριση Κρατήσεων
es: Gestión de Reservas
fr: Gestion des réservations

source: Microactivities
el: Μικροδραστηριότητες
es: Microactividades
fr: Microactivités

source: Machine Learning Check
el: Έλεγχος Μηχανικής Μάθησης
es: Verificación de Aprendizaje Automático
fr: Vérification d'apprentissage automatique

source: Report Shadow Microcontroller
el: Αναφορά Αντιγράφου Μικροελεγκτή
es: Reportar Microcontrolador Sombra
fr: Rapport du microcontrôleur fantôme

source: Show Serial Shadow Microcontroller
el: Εμφάνιση Σειριακού Αντιγράφου Μικροελεγκτή
es: Mostrar Microcontrolador Sombra Serial
fr: Afficher le microcontrôleur série fantôme

source: Show I2C Shadow Microcontroller
el: Εμφάνιση Αντιγράφου I2C Μικροελεγκτή
es: Mostrar Microcontrolador Sombra I2C
fr: Afficher le microcontrôleur I2C fantôme

source: Show I2C Shadow All Pins
el: Εμφάνιση Αντιγράφου I2C όλων των ακροδεκτών
es: Mostrar Todas las Pines de la Microcontrolador Sombra I2C
fr: Afficher tous les broches du microcontrôleur I2C fantôme

source: Logout
el: Αποσύνδεση
es: Cerrar Sesión
fr: Déconnexion

source: Sign Up
el: Εγγραφή
es: Registrarse
fr: S'inscrire

source: Log In
el: Είσοδος
es: Iniciar Sesión
fr: Se connecter

source: Time Expired
el: Ο χρόνος έληξε
es: Tiempo Expirado
fr: Temps écoulé

source: Remote Lab Embedded Test
el: Ενσωματωμένη Δοκιμή Απομακρυσμένου Εργαστηρίου
es: Prueba de Laboratorio Remoto Integrado
fr: Test du laboratoire à distance intégré

source: Test Lab
el: Δοκιμαστικό Εργαστήριο
es: Laboratorio de Prueba
fr: Laboratoire de test

source: Live View
el: Ζωντανή Προβολή
es: Vista en Vivo
fr: Vue en direct

source: Actuators
el: Ενεργοποιητές
es: Actuadores
fr: Actionneurs

source: Potentiometer
el: Ποτενσιόμετρο
es: Potenciómetro
fr: Potentiomètre

source: Sketches
el: Σχέδια
es: Bocetos
fr: Croquis

source: Select Activity:
el: Επιλογή Δραστηριότητας:
es: Seleccionar Actividad:
fr: Sélectionner une activité :

source: Select an activity
el: Επιλέξτε μια δραστηριότητα
es: Selecciona una actividad
fr: Sélectionner une activité

source: Code:
el: Κώδικας:
es: Código:

source: Select an activity from above
el: Επιλέξτε μια δραστηριότητα από πάνω
es: Selecciona una actividad de arriba
fr: Sélectionner une activité ci-dessus

source: Compile
el: Σύνταξη
es: Compilar
fr: Compiler

source: Upload Code
el: Μεταφόρτωση Κώδικα
es: Subir Código
fr: Télécharger le code

source: Login title
el: Είσοδος
es: Iniciar Sesión
fr: Connexion

source: Login body
el: Φόρμα
es: Iniciar Sesión
fr: Connexion

source: Signup title
el: Εγγραφή
es: Registrarse
fr: Inscription

source: Signup body
es: Registrarse
fr: Inscription

source: Required email
el: αρακαλώ δώστε email.
es: Por favor ingresa un correo electrónico.
fr: Veuillez saisir une adresse e-mail.

source: Required username
el: Παρακαλώ δώστε username
es: Por favor ingresa un nombre de usuario.
fr: Veuillez saisir un nom d'utilisateur.

source: Required password
el: Παρακαλώ δώστε password
es: Por favor ingresa una contraseña.
fr: Veuillez saisir un mot de passe.

source: Required password 2
el: Παρακαλώ επιβεβαιώστε το password.
es: Por favor vuelve a ingresar la contraseña.
fr: Veuillez ressaisir le mot de passe.

source: Signup button
es: Registrarse
fr: S'inscrire

source: Username
el: Όνομα χρήστη
es: Nombre de Usuario
fr: Nom d'utilisateur

source: This field can't be empty.
el: Αυτό το πεδίο δε μπορεί να είναι κενό.
es: Este campo no puede estar vacío.
fr: Ce champ ne peut pas être vide.

source: This field must have 3 to 15 characters
el: Αυτό το πεδίο πρέπει να έχει 3 έως 15 χαρακτήρες
es: Este campo debe tener entre 3 y 15 caracteres
fr: Ce champ doit contenir entre 3 et 15 caractères

source: Email
es: Correo Electrónico

source: Please enter a valid email address
el: Παρακαλώ εισάγετε μια έγκυρη διεύθυνση email
es: Por favor ingresa una dirección de correo electrónico válida
fr: Veuillez saisir une adresse e-mail valide

source: Password
el: Κωδικός
es: Contraseña
fr: Mot de passe

source: Confirm Password
el: Επιβεβαίωση Κωδικού
es: Confirmar Contraseña
fr: Confirmer le mot de passe

source: Passwords must match
el: Οι κωδικοί πρέπει να ταιριάζουν
es: Las contraseñas deben coincidir
fr: Les mots de passe doivent correspondre

source: This email is already taken.
es: Este correo electrónico ya está registrado.
fr: Cet e-mail est déjà utilisé.

source: Remember me
es: Recuérdame
fr: Se souvenir de moi

source: Title project without spaces
el: Τίτλος Σχεδίου (χωρίς κενά)
es: Título del proyecto sin espacios
fr: Titre du projet sans espaces

source: Must be at least 5 characters long
es: Debe tener al menos 5 caracteres de longitud
fr: Doit contenir au moins 5 caractères

source: Activity Title
el: Τίτλος δραστηριότητας
es: Título de la Actividad
fr: Titre de l'activité

source: This field must have 3 to 50 characters
el: Τίτλος δραστηριότητας
es: Este campo debe tener entre 3 y 50 caracteres
fr: Ce champ doit contenir entre 3 et 50 caractères

source: Activity Description
el: Περιγραφή δραστηριότητας
es: Descripción de la Actividad
fr: Description de l'activité

source: Activity description must be at least 5 characters
el: Η περιγραφή της δραστηριότητας πρέπει να είναι τουλάχιστον 5 χαρακτήρες
es: La descripción de la actividad debe tener al menos 5 caracteres
fr: La description de l'activité doit contenir au moins 5 caractères

source: Shadow microcontroller sketch.
el: Σκιά σκίτσο μικροελεγκτή.
es: Esquema del microcontrolador sombra.
fr: Croquis du microcontrôleur fantôme.

source: Sketch characters are to few
el: Οι χαρακτήρες σκίτσου είναι πολύ λίγοι
es: Hay pocos caracteres en el esquema
fr: Il y a trop peu de caractères dans le croquis

source: Activitys' Image
el: Εικόνα των δραστηριοτήτων
es: Imagen de la Actividad
fr: Image de l'activité

source: Microactivities path
el: Μονοπάτι μικροδραστηριοτήτων
es: Ruta de Microactividades
fr: Chemin des microactivités

source: Microactivities path must be have at least 5 characters
el: Η διαδρομή των μικροδραστηριοτήτων πρέπει να έχει τουλάχιστον 5 χαρακτήρες
es: La ruta de las microactividades debe tener al menos 5 caracteres
fr: Le chemin des microactivités doit contenir au moins 5 caractères

source: Machine Learning Model
el: Μοντέλο μηχανικής μάθησης
es: Modelo de Aprendizaje Automático
fr: Modèle d'apprentissage automatique

source: Mission
el: Αποστολή
es: Misión

source: Article image
el: Εικόνα Άρθρου
es: Imagen del Artículo
fr: Image de l'article

source: Submit
el: Υποβολή
es: Enviar
fr: Soumettre

source: Image Profile
el: Εικόνα Προφίλ
es: Imagen de Perfil
fr: Image de profil

source: send to
el: Στείλτε στο
es: Enviar a
fr: envoyer à

source: This username already exists!
el: Αυτό το username υπάρχει ήδη!
es: ¡Este nombre de usuario ya existe!
fr: Ce nom d'utilisateur existe déjà !

source: Storage
el: Αποθήκευση
es: Almacenamiento
fr: Stockage

source: User_login_fail
el: Η είσοδος του χρήστη ήταν ανεπιτυχής, παρακαλούμε δοκιμάστε ξανά με τα σωστά email/password.
es: Inicio de sesión de usuario fallido. Por favor intenta de nuevo con el correo electrónico/contraseña correctos.
fr: Échec de la connexion de l'utilisateur. Veuillez réessayer avec un e-mail/mot de passe correct.

source: error_404
el: Error 404: Η σελίδα που ζητήσατε δε βρέθηκε!
es: Error 404: Página No Encontrada
fr: Erreur 404 : Page non trouvée

source: Required user picture
el: Παρακαλώ δώστε μία εικόνα για το προφίλ σας.
es: Por favor proporciona una imagen para tu perfil.
fr: Veuillez fournir une image pour votre profil.

source: Account update title
el: Λογαριασμός Χρήστη
es: Cuenta de Usuario
fr: Compte utilisateur

source: Account update body
el: Φόρμα Ενημέρωσης Λογαριασμού
es: Formulario de Actualización de Cuenta
fr: Formulaire de mise à jour du compte

source: The user with email: {email} has not logged in before.
el: Ο χρήστης με email: {email} δεν έχει ξανασυνδεθεί.
es: El usuario con correo electrónico: {email} no ha iniciado sesión previamente.
fr: L'utilisateur avec l'email : {email} ne s'est pas encore connecté.

source: The user with email: {email} was successfully created.
el: Ο χρήστης με email: {email} δημιουργήθηκε με επιτυχία.
es: El usuario con correo electrónico: {email} se creó correctamente.
fr: L'utilisateur avec l'email : {email} a été créé avec succès.

source: The user with email: {email} WAS NOT created in the lab.
el: Ο χρήστης με email: {email} ΔΕΝ δημιουργήθηκε στο εργαστήριο.
es: El usuario con correo electrónico: {email} NO se creó en el laboratorio.
fr: L'utilisateur avec l'email : {email} N'A PAS été créé dans le laboratoire.

source: not admin
es: no es administrador
fr: pas admin

source: You have logged in as Administrator.
el: Έχετε συνδεθεί ως Διαχειριστής.
es: Ha iniciado sesión como Administrador.
fr: Vous êtes connecté en tant qu'administrateur.

source: Previous connection detected, without proper logout. Please log in again.
el: Διαπιστώθηκε προηγούμενη σύνδεση, χωρίς σωστή έξοδο. Σύνδεση ξανά.
es: Se detectó una conexión previa sin cierre de sesión adecuado. Por favor, vuelva a iniciar sesión.
fr: Connexion précédente détectée, sans déconnexion correcte. Veuillez vous reconnecter.

source: Unable to set ActiveActivity
el: Δεν μπόρεσε να καταχωρηθεί η ActiveActivity
es: No se pudo establecer ActiveActivity
fr: Impossible de définir ActiveActivity

source: No activity parameter was sent. The first activity is being activated.
el: Δεν έχει σταλεί παράμετρος Δραστηριοτητας. Ενεγοποιείται η 1η δραστηριοτητα.
es: No se envió el parámetro de actividad. Se está activando la primera actividad.
fr: Aucun paramètre d'activité n'a été envoyé. La première activité est en train d'être activée.

source: The requested activity was not found. The first activity is being activated.
el: Η Δραστηριότητα που ζητείται να ενεργοποιηθεί δεν βρέθηκε. Ενεγοποιείται η 1η δραστηριοτητα.
es: No se encontró la actividad solicitada. Se está activando la primera actividad.
fr: L'activité demandée n'a pas été trouvée. La première activité est en train d'être activée.

source: ******LaunchId set to
es: ******LaunchId establecido en
fr: ******LaunchId défini sur

source: Booking System activated.
el: Βρέθηκε ενεργοποιημένο το Booking System.
es: Sistema de reserva activado.
fr: Système de réservation activé.

source: Timeslot is not free.
el: Η χρονοθυρίδα της ώρας αυτής είναι δεσμευμένη.
es: El intervalo de tiempo no está libre.
fr: L'horodatage n'est pas libre.

source: User with email: {email} logged into the lab successfully.
el: Η είσοδος του χρήστη με email: {email} στο εργαστήριο έγινε με επιτυχία.
es: El usuario con correo electrónico: {email} ha iniciado sesión en el laboratorio correctamente.
fr: L'utilisateur avec l'email : {email} s'est connecté au laboratoire avec succès.

source: The timeslot has been booked. You are logged in as the Lab Owner.
el: Έχει κάνει κράτηση τη παρουσα χρονοθυρίδα. Συνδεθήκατε ως Κύριος Χρήστης Εργαστηρίου.
es: El intervalo de tiempo ha sido reservado. Ha iniciado sesión como Propietario del Laboratorio.
fr: L'intervalle de temps a été réservé. Vous êtes connecté en tant que propriétaire du laboratoire.

source: The timeslot is reserved by another user. You are logged in as a viewer. Some lab functions are disabled.
el: Η χρονοθυρίδα είναι δεσμευμένη από άλλο χρηστη. Συνδέεστε ως θεατής. Κάποιες λειτουργίες στο εργαστήριο είναι απενεργοποιημένες.
es: El intervalo de tiempo está reservado por otro usuario. Ha iniciado sesión como espectador. Algunas funciones del laboratorio están deshabilitadas.
fr: L'intervalle de temps est réservé par un autre utilisateur. Vous êtes connecté en tant que spectateur. Certaines fonctions du laboratoire sont désactivées.

source: This timeslot is available. You can book and log in again as the owner.
el: Η χρονοθυρίδα της ώρας αυτής είναι διαθέσιμη. Μπορείτε να κάνετε κράτηση και να συνδεθείτε ξανά ως κύριος χρήστης.
es: Este intervalo de tiempo está disponible. Puede reservarlo e iniciar sesión nuevamente como propietario.
fr: Cet intervalle de temps est disponible. Vous pouvez le réserver et vous connecter à nouveau en tant que propriétaire.

source: There is no user using the lab. You are logged in as the Lab Owner.
el: Δεν υπάρχει χρήστης που χρησιμοποιεί το εργαστήριο. Συνδεθήκατε ως Κύριος Χρήστης Εργαστηρίου.
es: No hay usuarios utilizando el laboratorio. Ha iniciado sesión como Propietario del Laboratorio.
fr: Aucun utilisateur n'utilise le laboratoire. Vous êtes connecté en tant que propriétaire du laboratoire.

source: There is already a user using the lab. You are logged in as a viewer. Some lab functions are disabled.
el: Υπάρχει ήδη χρήστης που χρησιμοποιεί το εργαστήριο. Συνδέεστε ως θεατής. Κάποιες λειτουργίες στο εργαστήριο είναι απενεργοποιημένες.
es: Ya hay un usuario utilizando el laboratorio. Ha iniciado sesión como espectador. Algunas funciones del laboratorio están deshabilitadas.
fr: Il y a déjà un utilisateur utilisant le laboratoire. Vous êtes connecté en tant que spectateur. Certaines fonctions du laboratoire sont désactivées.

source: User logged out successfully.
el: Έγινε αποσύνδεση του χρήστη με επιτυχία.
es: Usuario desconectado correctamente.
fr: Déconnexion réussie de l'utilisateur.

source: The ActiveActivity was not saved.
el: Δεν αποθηκεύτηκε η ActiveActivity
es: No se guardó la ActiveActivity.
fr: L'ActiveActivity n'a pas été enregistrée.

source: Sketches by
el: Σχέδια από τον/την
es: Bocetos de
fr: Croquis par

source: Must be at least 5 characters long
el: Το κείμενο του άρθρου πρέπει να έχει τουλάχιστον 5 χαρακτήρες
